{
  "backend/main.mo": "Canister actor managing access control, storage mixins, venture groups, users, financial records, and automatic milestone generation via crop templates.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs linked to two money-handling and dashboard-consistency features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing behavior and purpose of key frontend components, pages, hooks, and styles for documentation or build planning.",
  "frontend/index.html": "Minimal HTML entry page mounting the React app and loading src/main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling authentication state, routing between pages, and navigation to group detail and group dashboard views.",
  "frontend/src/components/AddContributionDialog.tsx": "Dialog for members to submit new contributions, parsing money input to cents and posting data via useAddContribution.",
  "frontend/src/components/AddExpenseDialog.tsx": "Dialog for adding group expenses with category selection, money-to-cents parsing, optional receipt image upload, and backend submission.",
  "frontend/src/components/AddMilestoneDialog.tsx": "Form dialog for creating a milestone with name, description, date, optional image, and submission via useAddMilestone.",
  "frontend/src/components/AddPlannedPaymentDialog.tsx": "Dialog to schedule a planned payment for a group member, including amount, due date, description, and member selection.",
  "frontend/src/components/AddRevenueDialog.tsx": "Form dialog to record revenue with source, amount, date, and description, submitting via useAddRevenue.",
  "frontend/src/components/CreateGroupDialog.tsx": "Dialog for creating a new venture group with crop template support, contribution settings, and date fields.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, authentication handling, group breadcrumb, and mobile menu support.",
  "frontend/src/components/MyPlannedPayments.tsx": "Displays the user's planned payments, grouping them into overdue and upcoming and rendering each with status badges.",
  "frontend/src/components/PayoutCalculator.tsx": "Calculates and displays payout suggestions for a group and allows admins to mark member payouts as paid.",
  "frontend/src/components/PlannedPaymentsSection.tsx": "Shows a group's planned payments sorted by status and allows admins to add new planned payments.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to enter and submit profile details including name, country, and optional phone.",
  "frontend/src/components/ReceiptModal.tsx": "Modal for viewing and downloading an uploaded receipt image tied to an expense.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and identity lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Provides many React Query hooks for fetching and mutating user profiles, venture groups, crop templates, and various group-related data via the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines extensive CSS variables for light and dark themes.",
  "frontend/src/lib/money.ts": "Utility functions for formatting, parsing, and validating money values stored as cents.",
  "frontend/src/lib/moneyMath.ts": "Provides helpers for summing cent values and calculating percentages while staying in cents.",
  "frontend/src/lib/normalizeExpenseAmount.ts": "Empty placeholder file for expense amount normalization logic.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, Internet Identity, and global styles.",
  "frontend/src/pages/Contributions.tsx": "Displays and manages user contributions across venture groups, including filtering, totals, and deletion.",
  "frontend/src/pages/Dashboard.tsx": "Shows an overview of user-related venture group stats, profile greeting, and planned payments.",
  "frontend/src/pages/GroupDashboard.tsx": "Renders detailed dashboard for a specific venture group including finances, milestones, and activity.",
  "frontend/src/pages/GroupDetail.tsx": "Detailed group view showing contributions, expenses, milestones, revenues, progress, and admin actions with dialogs and deletion support.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with marketing content, feature highlights, and login CTA via Internet Identity.",
  "frontend/src/pages/Milestones.tsx": "Displays milestones for selected user groups, including status counts and filtering based on membership.",
  "frontend/src/pages/MyGroups.tsx": "Lists user-admin and member groups, supports searching, joining groups, and navigating to group details.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Tracks project state for fixing a currency formatting regression where dashboard displays added zeros; includes existing features, pending requests, and notes ensuring amounts use raw cent values with correct display conversion."
}