{
  "backend/main.mo": "Motoko canister managing access control, storage mixins, venture groups, user data, and automatically generated crop-based milestones.",
  "feature_evidence.json": "Feature evidence report listing logo visibility updates and related asset changes with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including pages, components, hooks, and dialogs.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app controlling authentication, routing, group navigation, and profile setup flow.",
  "frontend/src/components/AddContributionDialog.tsx": "Dialog for adding member contributions with amount parsing, date input, and mutation submission.",
  "frontend/src/components/AddExpenseDialog.tsx": "Dialog for adding group expenses with category selection, receipt upload, amount parsing, and mutation handling.",
  "frontend/src/components/AddMilestoneDialog.tsx": "Dialog for creating a milestone with name, description, date, and optional image, then submitting via useAddMilestone.",
  "frontend/src/components/AddPlannedPaymentDialog.tsx": "Dialog to schedule a planned payment for a group member, handling amount, date, member selection, and submission via useCreatePlannedPayment.",
  "frontend/src/components/AddRevenueDialog.tsx": "Dialog for adding revenue entries with source, amount, date, and description, submitted through useAddRevenue.",
  "frontend/src/components/CreateGroupDialog.tsx": "Dialog to create a new venture group with details like name, crop type, contribution settings, and dates, submitted via useCreateVentureGroup.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication controls, mobile menu, and optional group breadcrumb based on selectedGroup.",
  "frontend/src/components/MyPlannedPayments.tsx": "Displays the user's planned payments, grouping them into overdue and upcoming and rendering each with badges and details.",
  "frontend/src/components/PayoutCalculator.tsx": "Calculates and displays payout suggestions for a group, summarizes totals, and lets admins mark payouts as paid.",
  "frontend/src/components/PlannedPaymentsSection.tsx": "Shows a group's planned payments categorized by status and allows admins to add new payments.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new users to enter basic profile information and submit it to the backend.",
  "frontend/src/components/ReceiptModal.tsx": "Modal that displays a receipt image and provides an option to download it.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity state and actions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, venture groups, crop templates, admin status, and various group-related data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark themes, including color tokens and global styles.",
  "frontend/src/lib/money.ts": "Utility functions for formatting, converting, parsing, and validating money values stored as cents.",
  "frontend/src/lib/normalizeExpenseAmount.ts": "Normalizes historically mis-scaled expense amounts and formats them for display.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/Contributions.tsx": "UI page that displays and manages a user's contributions across venture groups with filtering and deletion support.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard showing group statistics, profile info, and planned payments overview.",
  "frontend/src/pages/GroupDashboard.tsx": "Group-specific dashboard displaying financial metrics, progress, milestones, and recent activity, with admin access controls.",
  "frontend/src/pages/GroupDetail.tsx": "Group detail page showing contributions, expenses, milestones, activity, and actions with dialogs and delete handlers.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, features list, impact points, and login CTA using Internet Identity.",
  "frontend/src/pages/Milestones.tsx": "Milestone viewer allowing users to select a group and see completed and pending milestones with stats.",
  "frontend/src/pages/MyGroups.tsx": "Displays user’s groups, searchable lists, join actions, and group creation dialog with navigation hooks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Tracks project metadata, known issues, feature requirements, and new feature requests for improving header logo visibility. Includes image update instructions and project configuration details."
}