{
  "kind": "build_request",
  "title": "Revert currency scaling regression so dashboards display correct amounts and calculations use raw stored values",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove any frontend money display logic that heuristically rescales stored values (e.g., dividing/multiplying by 100 based on magnitude) and ensure all monetary amounts are displayed strictly by converting backend-stored cents to units exactly once using the centralized money utilities.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want you to reset the changes you made in the app in version 30.",
          "the values should display exactly the way they are entered",
          "It was only displayed incorrectly in the dashbaord"
        ]
      },
      "acceptanceCriteria": [
        "No UI path divides/multiplies amounts by 100 based on heuristics (e.g., removes/avoids use of normalizeExpenseAmount-style logic for display).",
        "All displayed monetary values are derived from backend values via a single, consistent conversion (e.g., centsToUnits / formatMoneyFromCents).",
        "Regression test: an amount entered as 100.00 displays as 100.00 (not 10000.00 or 1.00) everywhere it appears in dashboards and lists."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Audit and fix all dashboard-related pages/components so that amounts and totals (including group cards, group dashboards, returns, payouts, and summary tiles) use consistent formatting and correct arithmetic: sums should be computed in cents (integer) and converted for display at the final step, with no double-conversion or mixed unit math.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make sure all the calculations of entered information are done well without scaling values"
        ]
      },
      "acceptanceCriteria": [
        "All dashboard totals (e.g., total raised/spent/revenue/net profit/remaining balance, contribution totals, payout totals, returns totals) match the underlying stored values when verified by manual calculation from the same source data.",
        "No component mixes cents and units in the same calculation (e.g., does not add a cents value to a units value).",
        "Currency display is consistently rendered with the group currency code and exactly two decimals across dashboard views."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure backend data contracts for monetary values used by dashboards are consistent (all monetary amounts returned to the frontend are in cents as integers) and do not apply any scaling or formatting before returning values; adjust backend calculations if any endpoint currently returns unit values or scaled values.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If the backend data is viewable, check if the data is consistent for the live app"
        ]
      },
      "acceptanceCriteria": [
        "Backend methods used by dashboard/summary endpoints return monetary values in cents consistently (no mixed units across fields).",
        "Backend computations (e.g., totals and net profit) are performed using integer cents only.",
        "No state migration is introduced since the user confirmed stored values are already correct (display-only bug)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/immutablePaths must not be modified (compose existing UI components instead).",
    "Maintain the single-actor Motoko backend architecture; place backend logic changes only in backend/main.mo and add backend/migration.mo only if state schema changes (not expected for this fix).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Do not modify or attempt to repair existing stored transaction amounts (user confirmed data is correct and only display was wrong).",
    "Do not add new financial features, currencies, or payment providers.",
    "Do not implement external data checks against 'live app' outside the canister (no external database/analytics access)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}